# 5.1. Создайте любой класс с произвольным количеством подклассов, экземпляров, атрибутов
# и методов - как минимум один атрибут должен быть с уровнем доступа private.
# Соответственно, для получания значений этого атрибута нужно использовать методы get и set
#
# 5.2. Cоздайте репозиторий на Github и отправте файл с домашним заданием в этот удаленный репозиторий

# def count_of_word(words, letter):
#     n = 0
#     for word in words:
#         if letter in word:
#             n += 1
#     return n


