#  Home work 1
# 1.1
# 2)
# print("Hello World!")

# 3) Напишите программу, которая на входе получает имя пользователя,
# cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
# user_name = input("Введите свое имя: ")
# print(f"Hello {user_name} !")


# 1.2
#     1) Напишите программу, чтобы вывести:
#
# *********
# *       *
# *       *
# *********

# Вариант 1
# print("*********")
# print("*       *")
# print("*       *")
# print("*********")

# Вариант 2
# a = "*********"
# b = "*       *"
# print(a, b, b, a, sep="\n", end="")

# # Вариант 3
# for i in range(1, 5):
#     if i == 1 or i == 4:
#         print("*********")
#     else:
#         print("*       *")

# Ревью
def my_function(par):
    print(par)
    print(type(par))


'''
par = 5
my_function(par)
par = "string"
my_function(par)
par = 3.14
my_function(par)
par = True
my_function(par)
'''
print(1)


